##################################################################
##################################################################

BUILD_ID: 100000_300_50_50_0.3_32_2_glove.6B.300d.txt_1518144898
training: 7789.777142742008
predicting: 763.7803879690182_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 414)               0         
_________________________________________________________________
embedding_6 (Embedding)      (None, 414, 300)          30000000  
_________________________________________________________________
bidirectional_6 (Bidirection (None, 414, 100)          140400    
_________________________________________________________________
global_max_pooling1d_6 (Glob (None, 100)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_12 (Dense)             (None, 6)                 306       
=================================================================
Total params: 30,145,756
Trainable params: 30,145,756
Non-trainable params: 0
_________________________________________________________________
##################################################################
##################################################################

BUILD_ID: 100000_200_50_50_0.3_32_2_glove.6B.200d.txt_1518153808
training: 8025.948272122012
predicting: 771.8884270009876_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 414)               0         
_________________________________________________________________
embedding_7 (Embedding)      (None, 414, 200)          20000000  
_________________________________________________________________
bidirectional_7 (Bidirection (None, 414, 100)          100400    
_________________________________________________________________
global_max_pooling1d_7 (Glob (None, 100)               0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_14 (Dense)             (None, 6)                 306       
=================================================================
Total params: 20,105,756
Trainable params: 20,105,756
Non-trainable params: 0
_________________________________________________________________
##################################################################
##################################################################

BUILD_ID: 100000_100_50_50_0.3_32_2_glove.6B.100d.txt_1518162974
training: 7818.92684711999
predicting: 763.9977589509799_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         (None, 414)               0         
_________________________________________________________________
embedding_8 (Embedding)      (None, 414, 100)          10000000  
_________________________________________________________________
bidirectional_8 (Bidirection (None, 414, 100)          60400     
_________________________________________________________________
global_max_pooling1d_8 (Glob (None, 100)               0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_16 (Dense)             (None, 6)                 306       
=================================================================
Total params: 10,065,756
Trainable params: 10,065,756
Non-trainable params: 0
_________________________________________________________________
##################################################################
##################################################################

BUILD_ID: 100000_100_50_50_0.3_32_10_glove.6B.100d.txt_1518278460
training: 10.323054284402234
predicting: 0.20678298227723443
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        (None, 414)               0         
_________________________________________________________________
embedding_10 (Embedding)     (None, 414, 100)          10000000  
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 414, 100)          60400     
_________________________________________________________________
global_max_pooling1d_10 (Glo (None, 100)               0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_20 (Dense)             (None, 6)                 306       
=================================================================
Total params: 10,065,756
Trainable params: 10,065,756
Non-trainable params: 0
_________________________________________________________________

performance: val_loss: [0.0533296879105945, 0.05110140616369044, 0.051979758594054855, 0.05252130990697374, 0.05407819549245768, 0.05615264482526332, 0.05536771373843595, 0.058447977067392146, 0.05866712049188575, 0.05674879795456496]
performance: loss: [0.09553851073488388, 0.049928233852252556, 0.04489367697788833, 0.041777135729083134, 0.03914432112887656, 0.03730641988962545, 0.035470271742111356, 0.03397809857920197, 0.032667563299007496, 0.03178859417802633]
performance: acc: [0.9784200022627729, 0.9824597934701306, 0.983803681590398, 0.9848168214147249, 0.9856999818837101, 0.9864566446128425, 0.9871599233016093, 0.9877773232838303, 0.9882287685487614, 0.9885270243682546]
performance: val_acc: [0.9820466096022625, 0.9821823840602057, 0.9822032732284671, 0.9817332881766014, 0.98136774453622, 0.9811901953573259, 0.9809499810641086, 0.9809082064477405, 0.9802815598314426, 0.9793729238349373]
params: steps: None
params: samples: 143613
params: do_validation: True
params: epochs: 10
params: metrics: ['loss', 'acc', 'val_loss', 'val_acc']
params: verbose: 1
params: batch_size: 32
